zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/inc/msp432p401m.h
#define FLCTL_BANK1_MAIN_WEPROT_PROT10           ((uint32_t)0x00000400)          /*!< Protects Sector 10 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT11] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT11_OFS       (11)                            /*!< PROT11 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT11           ((uint32_t)0x00000800)          /*!< Protects Sector 11 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT12] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT12_OFS       (12)                            /*!< PROT12 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT12           ((uint32_t)0x00001000)          /*!< Protects Sector 12 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT13] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT13_OFS       (13)                            /*!< PROT13 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT13           ((uint32_t)0x00002000)          /*!< Protects Sector 13 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT14] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT14_OFS       (14)                            /*!< PROT14 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT14           ((uint32_t)0x00004000)          /*!< Protects Sector 14 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT15] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT15_OFS       (15)                            /*!< PROT15 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT15           ((uint32_t)0x00008000)          /*!< Protects Sector 15 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT16] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT16_OFS       (16)                            /*!< PROT16 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT16           ((uint32_t)0x00010000)          /*!< Protects Sector 16 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT17] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT17_OFS       (17)                            /*!< PROT17 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT17           ((uint32_t)0x00020000)          /*!< Protects Sector 17 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT18] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT18_OFS       (18)                            /*!< PROT18 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT18           ((uint32_t)0x00040000)          /*!< Protects Sector 18 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT19] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT19_OFS       (19)                            /*!< PROT19 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT19           ((uint32_t)0x00080000)          /*!< Protects Sector 19 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT20] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT20_OFS       (20)                            /*!< PROT20 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT20           ((uint32_t)0x00100000)          /*!< Protects Sector 20 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT21] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT21_OFS       (21)                            /*!< PROT21 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT21           ((uint32_t)0x00200000)          /*!< Protects Sector 21 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT22] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT22_OFS       (22)                            /*!< PROT22 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT22           ((uint32_t)0x00400000)          /*!< Protects Sector 22 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT23] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT23_OFS       (23)                            /*!< PROT23 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT23           ((uint32_t)0x00800000)          /*!< Protects Sector 23 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT24] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT24_OFS       (24)                            /*!< PROT24 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT24           ((uint32_t)0x01000000)          /*!< Protects Sector 24 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT25] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT25_OFS       (25)                            /*!< PROT25 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT25           ((uint32_t)0x02000000)          /*!< Protects Sector 25 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT26] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT26_OFS       (26)                            /*!< PROT26 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT26           ((uint32_t)0x04000000)          /*!< Protects Sector 26 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT27] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT27_OFS       (27)                            /*!< PROT27 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT27           ((uint32_t)0x08000000)          /*!< Protects Sector 27 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT28] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT28_OFS       (28)                            /*!< PROT28 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT28           ((uint32_t)0x10000000)          /*!< Protects Sector 28 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT29] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT29_OFS       (29)                            /*!< PROT29 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT29           ((uint32_t)0x20000000)          /*!< Protects Sector 29 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT30] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT30_OFS       (30)                            /*!< PROT30 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT30           ((uint32_t)0x40000000)          /*!< Protects Sector 30 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[PROT31] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT31_OFS       (31)                            /*!< PROT31 Bit Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT31           ((uint32_t)0x80000000)          /*!< Protects Sector 31 from program or erase operations */
/* FLCTL_BMRK_CTLSTAT[I_BMRK] Bits */
#define FLCTL_BMRK_CTLSTAT_I_BMRK_OFS            ( 0)                            /*!< I_BMRK Bit Offset */
#define FLCTL_BMRK_CTLSTAT_I_BMRK                ((uint32_t)0x00000001)          
/* FLCTL_BMRK_CTLSTAT[D_BMRK] Bits */
#define FLCTL_BMRK_CTLSTAT_D_BMRK_OFS            ( 1)                            /*!< D_BMRK Bit Offset */
#define FLCTL_BMRK_CTLSTAT_D_BMRK                ((uint32_t)0x00000002)          
/* FLCTL_BMRK_CTLSTAT[CMP_EN] Bits */
#define FLCTL_BMRK_CTLSTAT_CMP_EN_OFS            ( 2)                            /*!< CMP_EN Bit Offset */
#define FLCTL_BMRK_CTLSTAT_CMP_EN                ((uint32_t)0x00000004)          
/* FLCTL_BMRK_CTLSTAT[CMP_SEL] Bits */
#define FLCTL_BMRK_CTLSTAT_CMP_SEL_OFS           ( 3)                            /*!< CMP_SEL Bit Offset */
#define FLCTL_BMRK_CTLSTAT_CMP_SEL               ((uint32_t)0x00000008)          
/* FLCTL_IFG[RDBRST] Bits */
#define FLCTL_IFG_RDBRST_OFS                     ( 0)                            /*!< RDBRST Bit Offset */
#define FLCTL_IFG_RDBRST                         ((uint32_t)0x00000001)          
/* FLCTL_IFG[AVPRE] Bits */
#define FLCTL_IFG_AVPRE_OFS                      ( 1)                            /*!< AVPRE Bit Offset */
#define FLCTL_IFG_AVPRE                          ((uint32_t)0x00000002)          
/* FLCTL_IFG[AVPST] Bits */
#define FLCTL_IFG_AVPST_OFS                      ( 2)                            /*!< AVPST Bit Offset */
#define FLCTL_IFG_AVPST                          ((uint32_t)0x00000004)          
/* FLCTL_IFG[PRG] Bits */
#define FLCTL_IFG_PRG_OFS                        ( 3)                            /*!< PRG Bit Offset */
#define FLCTL_IFG_PRG                            ((uint32_t)0x00000008)          
/* FLCTL_IFG[PRGB] Bits */
#define FLCTL_IFG_PRGB_OFS                       ( 4)                            /*!< PRGB Bit Offset */
#define FLCTL_IFG_PRGB                           ((uint32_t)0x00000010)          
/* FLCTL_IFG[ERASE] Bits */
#define FLCTL_IFG_ERASE_OFS                      ( 5)                            /*!< ERASE Bit Offset */
#define FLCTL_IFG_ERASE                          ((uint32_t)0x00000020)          
/* FLCTL_IFG[BMRK] Bits */
#define FLCTL_IFG_BMRK_OFS                       ( 8)                            /*!< BMRK Bit Offset */
#define FLCTL_IFG_BMRK                           ((uint32_t)0x00000100)          
/* FLCTL_IFG[PRG_ERR] Bits */
#define FLCTL_IFG_PRG_ERR_OFS                    ( 9)                            /*!< PRG_ERR Bit Offset */
#define FLCTL_IFG_PRG_ERR                        ((uint32_t)0x00000200)          
/* FLCTL_IE[RDBRST] Bits */
#define FLCTL_IE_RDBRST_OFS                      ( 0)                            /*!< RDBRST Bit Offset */
#define FLCTL_IE_RDBRST                          ((uint32_t)0x00000001)          
/* FLCTL_IE[AVPRE] Bits */
#define FLCTL_IE_AVPRE_OFS                       ( 1)                            /*!< AVPRE Bit Offset */
#define FLCTL_IE_AVPRE                           ((uint32_t)0x00000002)          
/* FLCTL_IE[AVPST] Bits */
#define FLCTL_IE_AVPST_OFS                       ( 2)                            /*!< AVPST Bit Offset */
#define FLCTL_IE_AVPST                           ((uint32_t)0x00000004)          
/* FLCTL_IE[PRG] Bits */
#define FLCTL_IE_PRG_OFS                         ( 3)                            /*!< PRG Bit Offset */
#define FLCTL_IE_PRG                             ((uint32_t)0x00000008)          
/* FLCTL_IE[PRGB] Bits */
#define FLCTL_IE_PRGB_OFS                        ( 4)                            /*!< PRGB Bit Offset */
#define FLCTL_IE_PRGB                            ((uint32_t)0x00000010)          
/* FLCTL_IE[ERASE] Bits */
#define FLCTL_IE_ERASE_OFS                       ( 5)                            /*!< ERASE Bit Offset */
#define FLCTL_IE_ERASE                           ((uint32_t)0x00000020)          
/* FLCTL_IE[BMRK] Bits */
#define FLCTL_IE_BMRK_OFS                        ( 8)                            /*!< BMRK Bit Offset */
#define FLCTL_IE_BMRK                            ((uint32_t)0x00000100)          
/* FLCTL_IE[PRG_ERR] Bits */
#define FLCTL_IE_PRG_ERR_OFS                     ( 9)                            /*!< PRG_ERR Bit Offset */
#define FLCTL_IE_PRG_ERR                         ((uint32_t)0x00000200)          
/* FLCTL_CLRIFG[RDBRST] Bits */
#define FLCTL_CLRIFG_RDBRST_OFS                  ( 0)                            /*!< RDBRST Bit Offset */
#define FLCTL_CLRIFG_RDBRST                      ((uint32_t)0x00000001)          
/* FLCTL_CLRIFG[AVPRE] Bits */
#define FLCTL_CLRIFG_AVPRE_OFS                   ( 1)                            /*!< AVPRE Bit Offset */
#define FLCTL_CLRIFG_AVPRE                       ((uint32_t)0x00000002)          
/* FLCTL_CLRIFG[AVPST] Bits */
#define FLCTL_CLRIFG_AVPST_OFS                   ( 2)                            /*!< AVPST Bit Offset */
#define FLCTL_CLRIFG_AVPST                       ((uint32_t)0x00000004)          
/* FLCTL_CLRIFG[PRG] Bits */
#define FLCTL_CLRIFG_PRG_OFS                     ( 3)                            /*!< PRG Bit Offset */
#define FLCTL_CLRIFG_PRG                         ((uint32_t)0x00000008)          
/* FLCTL_CLRIFG[PRGB] Bits */
#define FLCTL_CLRIFG_PRGB_OFS                    ( 4)                            /*!< PRGB Bit Offset */
#define FLCTL_CLRIFG_PRGB                        ((uint32_t)0x00000010)          
/* FLCTL_CLRIFG[ERASE] Bits */
#define FLCTL_CLRIFG_ERASE_OFS                   ( 5)                            /*!< ERASE Bit Offset */
#define FLCTL_CLRIFG_ERASE                       ((uint32_t)0x00000020)          
/* FLCTL_CLRIFG[BMRK] Bits */
#define FLCTL_CLRIFG_BMRK_OFS                    ( 8)                            /*!< BMRK Bit Offset */
#define FLCTL_CLRIFG_BMRK                        ((uint32_t)0x00000100)          
/* FLCTL_CLRIFG[PRG_ERR] Bits */
#define FLCTL_CLRIFG_PRG_ERR_OFS                 ( 9)                            /*!< PRG_ERR Bit Offset */
#define FLCTL_CLRIFG_PRG_ERR                     ((uint32_t)0x00000200)          
/* FLCTL_SETIFG[RDBRST] Bits */
#define FLCTL_SETIFG_RDBRST_OFS                  ( 0)                            /*!< RDBRST Bit Offset */
#define FLCTL_SETIFG_RDBRST                      ((uint32_t)0x00000001)          
/* FLCTL_SETIFG[AVPRE] Bits */
#define FLCTL_SETIFG_AVPRE_OFS                   ( 1)                            /*!< AVPRE Bit Offset */
#define FLCTL_SETIFG_AVPRE                       ((uint32_t)0x00000002)          
/* FLCTL_SETIFG[AVPST] Bits */
#define FLCTL_SETIFG_AVPST_OFS                   ( 2)                            /*!< AVPST Bit Offset */
#define FLCTL_SETIFG_AVPST                       ((uint32_t)0x00000004)          
/* FLCTL_SETIFG[PRG] Bits */
#define FLCTL_SETIFG_PRG_OFS                     ( 3)                            /*!< PRG Bit Offset */
#define FLCTL_SETIFG_PRG                         ((uint32_t)0x00000008)          
/* FLCTL_SETIFG[PRGB] Bits */
#define FLCTL_SETIFG_PRGB_OFS                    ( 4)                            /*!< PRGB Bit Offset */
#define FLCTL_SETIFG_PRGB                        ((uint32_t)0x00000010)          
/* FLCTL_SETIFG[ERASE] Bits */
#define FLCTL_SETIFG_ERASE_OFS                   ( 5)                            /*!< ERASE Bit Offset */
#define FLCTL_SETIFG_ERASE                       ((uint32_t)0x00000020)          
/* FLCTL_SETIFG[BMRK] Bits */
#define FLCTL_SETIFG_BMRK_OFS                    ( 8)                            /*!< BMRK Bit Offset */
#define FLCTL_SETIFG_BMRK                        ((uint32_t)0x00000100)          
/* FLCTL_SETIFG[PRG_ERR] Bits */
#define FLCTL_SETIFG_PRG_ERR_OFS                 ( 9)                            /*!< PRG_ERR Bit Offset */
#define FLCTL_SETIFG_PRG_ERR                     ((uint32_t)0x00000200)          
/* FLCTL_READ_TIMCTL[SETUP] Bits */
#define FLCTL_READ_TIMCTL_SETUP_OFS              ( 0)                            /*!< SETUP Bit Offset */
#define FLCTL_READ_TIMCTL_SETUP_MASK             ((uint32_t)0x000000FF)          /*!< SETUP Bit Mask */
/* FLCTL_READ_TIMCTL[IREF_BOOST1] Bits */
#define FLCTL_READ_TIMCTL_IREF_BOOST1_OFS        (12)                            /*!< IREF_BOOST1 Bit Offset */
#define FLCTL_READ_TIMCTL_IREF_BOOST1_MASK       ((uint32_t)0x0000F000)          /*!< IREF_BOOST1 Bit Mask */
/* FLCTL_READ_TIMCTL[SETUP_LONG] Bits */
#define FLCTL_READ_TIMCTL_SETUP_LONG_OFS         (16)                            /*!< SETUP_LONG Bit Offset */
#define FLCTL_READ_TIMCTL_SETUP_LONG_MASK        ((uint32_t)0x00FF0000)          /*!< SETUP_LONG Bit Mask */
/* FLCTL_READMARGIN_TIMCTL[SETUP] Bits */
#define FLCTL_READMARGIN_TIMCTL_SETUP_OFS        ( 0)                            /*!< SETUP Bit Offset */
#define FLCTL_READMARGIN_TIMCTL_SETUP_MASK       ((uint32_t)0x000000FF)          /*!< SETUP Bit Mask */
/* FLCTL_PRGVER_TIMCTL[SETUP] Bits */
#define FLCTL_PRGVER_TIMCTL_SETUP_OFS            ( 0)                            /*!< SETUP Bit Offset */
#define FLCTL_PRGVER_TIMCTL_SETUP_MASK           ((uint32_t)0x000000FF)          /*!< SETUP Bit Mask */
/* FLCTL_PRGVER_TIMCTL[ACTIVE] Bits */
#define FLCTL_PRGVER_TIMCTL_ACTIVE_OFS           ( 8)                            /*!< ACTIVE Bit Offset */
#define FLCTL_PRGVER_TIMCTL_ACTIVE_MASK          ((uint32_t)0x00000F00)          /*!< ACTIVE Bit Mask */
/* FLCTL_PRGVER_TIMCTL[HOLD] Bits */
#define FLCTL_PRGVER_TIMCTL_HOLD_OFS             (12)                            /*!< HOLD Bit Offset */
#define FLCTL_PRGVER_TIMCTL_HOLD_MASK            ((uint32_t)0x0000F000)          /*!< HOLD Bit Mask */
/* FLCTL_ERSVER_TIMCTL[SETUP] Bits */
#define FLCTL_ERSVER_TIMCTL_SETUP_OFS            ( 0)                            /*!< SETUP Bit Offset */
#define FLCTL_ERSVER_TIMCTL_SETUP_MASK           ((uint32_t)0x000000FF)          /*!< SETUP Bit Mask */
/* FLCTL_LKGVER_TIMCTL[SETUP] Bits */
#define FLCTL_LKGVER_TIMCTL_SETUP_OFS            ( 0)                            /*!< SETUP Bit Offset */
#define FLCTL_LKGVER_TIMCTL_SETUP_MASK           ((uint32_t)0x000000FF)          /*!< SETUP Bit Mask */
/* FLCTL_PROGRAM_TIMCTL[SETUP] Bits */
#define FLCTL_PROGRAM_TIMCTL_SETUP_OFS           ( 0)                            /*!< SETUP Bit Offset */
#define FLCTL_PROGRAM_TIMCTL_SETUP_MASK          ((uint32_t)0x000000FF)          /*!< SETUP Bit Mask */
/* FLCTL_PROGRAM_TIMCTL[ACTIVE] Bits */
#define FLCTL_PROGRAM_TIMCTL_ACTIVE_OFS          ( 8)                            /*!< ACTIVE Bit Offset */
#define FLCTL_PROGRAM_TIMCTL_ACTIVE_MASK         ((uint32_t)0x0FFFFF00)          /*!< ACTIVE Bit Mask */
/* FLCTL_PROGRAM_TIMCTL[HOLD] Bits */
#define FLCTL_PROGRAM_TIMCTL_HOLD_OFS            (28)                            /*!< HOLD Bit Offset */
#define FLCTL_PROGRAM_TIMCTL_HOLD_MASK           ((uint32_t)0xF0000000)          /*!< HOLD Bit Mask */
/* FLCTL_ERASE_TIMCTL[SETUP] Bits */
#define FLCTL_ERASE_TIMCTL_SETUP_OFS             ( 0)                            /*!< SETUP Bit Offset */
#define FLCTL_ERASE_TIMCTL_SETUP_MASK            ((uint32_t)0x000000FF)          /*!< SETUP Bit Mask */
/* FLCTL_ERASE_TIMCTL[ACTIVE] Bits */
#define FLCTL_ERASE_TIMCTL_ACTIVE_OFS            ( 8)                            /*!< ACTIVE Bit Offset */
#define FLCTL_ERASE_TIMCTL_ACTIVE_MASK           ((uint32_t)0x0FFFFF00)          /*!< ACTIVE Bit Mask */
/* FLCTL_ERASE_TIMCTL[HOLD] Bits */
#define FLCTL_ERASE_TIMCTL_HOLD_OFS              (28)                            /*!< HOLD Bit Offset */
#define FLCTL_ERASE_TIMCTL_HOLD_MASK             ((uint32_t)0xF0000000)          /*!< HOLD Bit Mask */
/* FLCTL_MASSERASE_TIMCTL[BOOST_ACTIVE] Bits */
#define FLCTL_MASSERASE_TIMCTL_BOOST_ACTIVE_OFS  ( 0)                            /*!< BOOST_ACTIVE Bit Offset */
#define FLCTL_MASSERASE_TIMCTL_BOOST_ACTIVE_MASK ((uint32_t)0x000000FF)          /*!< BOOST_ACTIVE Bit Mask */
/* FLCTL_MASSERASE_TIMCTL[BOOST_HOLD] Bits */
#define FLCTL_MASSERASE_TIMCTL_BOOST_HOLD_OFS    ( 8)                            /*!< BOOST_HOLD Bit Offset */
#define FLCTL_MASSERASE_TIMCTL_BOOST_HOLD_MASK   ((uint32_t)0x0000FF00)          /*!< BOOST_HOLD Bit Mask */
/* FLCTL_BURSTPRG_TIMCTL[ACTIVE] Bits */
#define FLCTL_BURSTPRG_TIMCTL_ACTIVE_OFS         ( 8)                            /*!< ACTIVE Bit Offset */
#define FLCTL_BURSTPRG_TIMCTL_ACTIVE_MASK        ((uint32_t)0x0FFFFF00)          /*!< ACTIVE Bit Mask */

